Revit 2027 API
IFCData.CreateString Method
 Creates a string data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateString(
	string value
)
Public Shared Function CreateString (
	value As String
) As IFCData
public:
static IFCData^ CreateString(
	String^ value
)
static member CreateString :
        value : string -> IFCData
Parameters
value String
 The string value.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace